Revit 2026 API

# PolyLineCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PolyLine Create(
	IList<XYZ> coordinates
)
```
```vb
Public Shared Function Create (
	coordinates As IList(Of XYZ)
) As PolyLine
```
```cpp
public:
static PolyLine^ Create(
	IList<XYZ^>^ coordinates
)
```
```fsharp
static member Create :
        coordinates : IList<XYZ> -> PolyLine
```

#### Parameters

coordinates IListXYZ

#### Return Value

PolyLine

#### Reference

PolyLine Class

Autodesk.Revit.DB Namespace